{
  "backend/main.mo": "Backend canister managing user profiles, access control, approvals, and admin actions like activation and deactivation.",
  "feature_evidence.json": "List of implemented features with associated files, components, tests, and confidence data for traceability.",
  "frontend-file-summaries.txt": "Existing summaries of all frontend files describing their purpose and functionality.",
  "frontend/index.css": "Tailwind-based global stylesheet defining OKLCH color variables and light/dark theme tokens.",
  "frontend/index.html": "Main HTML entry point setting metadata, PWA manifest, icons, and mounting the React app.",
  "frontend/public/manifest.webmanifest": "PWA manifest defining app name, icons, theme colors, and installation settings.",
  "frontend/public/service-worker.js": "Simple service worker providing asset caching, fetch fallback, and automatic cache cleanup.",
  "frontend/src/App.tsx": "Main React router setup with authentication guards, layout handling, and protected routes for dashboard, memory, question papers, and admin pages.",
  "frontend/src/components/layout/AppLayout.tsx": "Layout component with navigation, user menu, and logout handling using Internet Identity and admin checks.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the authenticated/anonymous backend actor, invalidating related queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, handling login, logout, and persisted identities.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks wrapping backend actor calls for user profiles, roles, admin checks, and approval-related actions.",
  "frontend/src/index.css": "Tailwind CSS setup defining light/dark theme colors and global styling rules.",
  "frontend/src/main.tsx": "Entry point initializing React, QueryClient, Internet Identity provider, and global styles.",
  "frontend/src/pages/admin/AdminPanelPage.tsx": "No summary available.",
  "frontend/src/pages/DashboardPage.tsx": "Dashboard UI with links to memory and question paper sections and an overview of the platform.",
  "frontend/src/pages/LoginPage.tsx": "Login page using Internet Identity, redirecting authenticated users and showing a sign‑in button.",
  "frontend/src/pages/memory/MemoryPage.tsx": "A placeholder memory-management page showing upcoming upload, folder, and search features and an empty state for future file storage.",
  "frontend/src/pages/OnboardingUsernamePage.tsx": "A username onboarding form that validates input, saves a new user profile, handles errors, and redirects on success.",
  "frontend/src/pages/question-papers/QuestionPapersLandingPage.tsx": "A landing page for question‑paper features with cards for image uploads and external links, all currently disabled pending backend work.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, persisting, and clearing URL and session parameters, including hash‑based routing support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining theme colors, animations, container settings, and plugins like typography and container queries.",
  "project_state.json": "Defines project state for the AIT MIZO archive app, including architecture notes, required images, and a list of existing implemented features. Captures versioning, centralized-access model, and core functional requirements."
}